In [3]:
#FizzBuzz: 
#Go through the integers from 1 to 100. 
#If a number is divisible by 3, print "fizz." 
#If a number is divisible by 5, print "buzz." 
#If a number is both divisible by 3 and by 5, print "fizzbuzz." 
#Otherwise, print just the number. 


for n in range(1,101):
    if n%3==0 and n%5==0:
        print('fizzbuss')
    elif n%3==0:
        print('fizz')
    elif n%5==0:
        print('buzz')
    else:
        print(n)

1
2
fizz
4
buzz
fizz
7
8
fizz
buzz
11
fizz
13
14
fizzbuss
16
17
fizz
19
buzz
fizz
22
23
fizz
buzz
26
fizz
28
29
fizzbuss
31
32
fizz
34
buzz
fizz
37
38
fizz
buzz
41
fizz
43
44
fizzbuss
46
47
fizz
49
buzz
fizz
52
53
fizz
buzz
56
fizz
58
59
fizzbuss
61
62
fizz
64
buzz
fizz
67
68
fizz
buzz
71
fizz
73
74
fizzbuss
76
77
fizz
79
buzz
fizz
82
83
fizz
buzz
86
fizz
88
89
fizzbuss
91
92
fizz
94
buzz
fizz
97
98
fizz
buzz

In [4]:
import pandas as pd 
df = pd.read_csv('student(in).csv')
print(df)

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78     NaN
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row    NaN    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27          NaN  Three    81     NaN
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [5]:
df.head()
df.info()
df['mark'].mean()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      35 non-null     int64
 1   name    34 non-null     object
 2   class   34 non-null     object
 3   mark    35 non-null     int64
 4   gender  33 non-null     object
dtypes: int64(2), object(3)
memory usage: 1.5+ KB

74.65714285714286

In [6]:
df[['name','mark']]
df.head(3)

   id      name  class  mark  gender
0   1  John Deo   Four    75  female
1   2  Max Ruin  Three    85    male
2   3    Arnold  Three    55    male

In [7]:
df[df['class'] == 'Four']

    id         name class  mark  gender
0    1     John Deo  Four    75  female
3    4   Krish Star  Four    60  female
4    5    John Mike  Four    60  female
5    6    Alex John  Four    55    male
9   10     Big John  Four    55  female
15  16        Gimmy  Four    88    male
20  21   Babby John  Four    69  female
30  31  Marry Toeey  Four    88    male

In [11]:
df['Passed'] = df['mark'] >= 60
print(df)

    id         name  class  mark  gender  Passed
0    1     John Deo   Four    75  female    True
1    2     Max Ruin  Three    85    male    True
2    3       Arnold  Three    55    male   False
3    4   Krish Star   Four    60  female    True
4    5    John Mike   Four    60  female    True
5    6    Alex John   Four    55    male   False
6    7  My John Rob  Fifth    78    male    True
7    8       Asruid   Five    85    male    True
8    9      Tes Qry    Six    78     NaN    True
9   10     Big John   Four    55  female   False
10  11       Ronald    Six    89  female    True
11  12        Recky    Six    94  female    True
12  13          Kty  Seven    88  female    True
13  14         Bigy  Seven    88  female    True
14  15     Tade Row    NaN    88    male    True
15  16        Gimmy   Four    88    male    True
16  17        Tumyu    Six    54    male   False
17  18        Honny   Five    75    male    True
18  19        Tinny   Nine    18    male   False
19  20       Jackly   Nine    65  female    True
20  21   Babby John   Four    69  female    True
21  22       Reggid  Seven    55  female   False
22  23        Herod  Eight    79    male    True
23  24    Tiddy Now  Seven    78    male    True
24  25     Giff Tow  Seven    88    male    True
25  26       Crelea  Seven    79    male    True
26  27          NaN  Three    81     NaN    True
27  28    Rojj Base  Seven    86  female    True
28  29  Tess Played  Seven    55    male   False
29  30    Reppy Red    Six    79  female    True
30  31  Marry Toeey   Four    88    male    True
31  32    Binn Rott  Seven    90  female    True
32  33    Kenn Rein    Six    96  female    True
33  34     Gain Toe  Seven    69    male    True
34  35   Rows Noump    Six    88  female    True

In [13]:
df.rename(columns={'mark': 'score'}, inplace=True)

In [22]:
if 'Passed' in df.columns:
    df.drop('Passed', axis=1, inplace=True)
print(df)

    id         name  class  score  gender
0    1     John Deo   Four     75  female
1    2     Max Ruin  Three     85    male
2    3       Arnold  Three     55    male
3    4   Krish Star   Four     60  female
4    5    John Mike   Four     60  female
5    6    Alex John   Four     55    male
6    7  My John Rob  Fifth     78    male
7    8       Asruid   Five     85    male
8    9      Tes Qry    Six     78     NaN
9   10     Big John   Four     55  female
10  11       Ronald    Six     89  female
11  12        Recky    Six     94  female
12  13          Kty  Seven     88  female
13  14         Bigy  Seven     88  female
14  15     Tade Row    NaN     88    male
15  16        Gimmy   Four     88    male
16  17        Tumyu    Six     54    male
17  18        Honny   Five     75    male
18  19        Tinny   Nine     18    male
19  20       Jackly   Nine     65  female
20  21   Babby John   Four     69  female
21  22       Reggid  Seven     55  female
22  23        Herod  Eight     79    male
23  24    Tiddy Now  Seven     78    male
24  25     Giff Tow  Seven     88    male
25  26       Crelea  Seven     79    male
26  27          NaN  Three     81     NaN
27  28    Rojj Base  Seven     86  female
28  29  Tess Played  Seven     55    male
29  30    Reppy Red    Six     79  female
30  31  Marry Toeey   Four     88    male
31  32    Binn Rott  Seven     90  female
32  33    Kenn Rein    Six     96  female
33  34     Gain Toe  Seven     69    male
34  35   Rows Noump    Six     88  female

In [29]:
new_df = df.groupby("class")
for name, group in df.groupby('class'):
    print(name)
    print(group)

Eight
    id   name  class  score gender
22  23  Herod  Eight     79   male
Fifth
   id         name  class  score gender
6   7  My John Rob  Fifth     78   male
Five
    id    name class  score gender
7    8  Asruid  Five     85   male
17  18   Honny  Five     75   male
Four
    id         name class  score  gender
0    1     John Deo  Four     75  female
3    4   Krish Star  Four     60  female
4    5    John Mike  Four     60  female
5    6    Alex John  Four     55    male
9   10     Big John  Four     55  female
15  16        Gimmy  Four     88    male
20  21   Babby John  Four     69  female
30  31  Marry Toeey  Four     88    male
Nine
    id    name class  score  gender
18  19   Tinny  Nine     18    male
19  20  Jackly  Nine     65  female
Seven
    id         name  class  score  gender
12  13          Kty  Seven     88  female
13  14         Bigy  Seven     88  female
21  22       Reggid  Seven     55  female
23  24    Tiddy Now  Seven     78    male
24  25     Giff Tow  Seven     88    male
25  26       Crelea  Seven     79    male
27  28    Rojj Base  Seven     86  female
28  29  Tess Played  Seven     55    male
31  32    Binn Rott  Seven     90  female
33  34     Gain Toe  Seven     69    male
Six
    id        name class  score  gender
8    9     Tes Qry   Six     78     NaN
10  11      Ronald   Six     89  female
11  12       Recky   Six     94  female
16  17       Tumyu   Six     54    male
29  30   Reppy Red   Six     79  female
32  33   Kenn Rein   Six     96  female
34  35  Rows Noump   Six     88  female
Three
    id      name  class  score gender
1    2  Max Ruin  Three     85   male
2    3    Arnold  Three     55   male
26  27       NaN  Three     81    NaN